back/artillery-autoscaling-worker.yml
# Artillery Load Test - Worker Autoscaling Test
# Objetivo: Llenar la cola SQS con > 10 mensajes para activar autoscaling de workers
# Métrica objetivo: ApproximateNumberOfMessagesVisible > 10 para escalar de 1 → 3 workers

config:
  target: '{{ $processEnvironment.API_TARGET_URL }}'
  http:
    timeout: 300  # 5 minutos (uploads de video requieren más tiempo)
    pool: 50  # Suficiente para manejar carga concurrente de uploads
    maxSockets: 50
    keepAlive: true
  phases:
    # Fase 1: Warmup (3 minutos) - Preparar usuarios y tokens
    - duration: 180
      arrivalRate: 1
      name: "Warmup - Prepare Users"

    # Fase 2: Carga inicial GRADUAL (5 minutos) - Comenzar a llenar cola
    # 1→4 usuarios/s = ~2-3 uploads/min inicial, incrementando a ~10-15 uploads/min
    - duration: 300
      arrivalRate: 1
      rampTo: 4
      name: "Initial Video Load - Start Queue Buildup"

    # Fase 3: Carga sostenida moderada (12 minutos) - FORZAR AUTOSCALING DE WORKERS
    # 5 usuarios/s con 50% uploads = ~2.5 uploads/s = ~150 uploads/min
    # Suficiente para saturar 1 worker (capacity: ~4-8 videos/min) y llenar cola > 10 mensajes
    - duration: 720
      arrivalRate: 5
      name: "Sustained Video Upload - TRIGGER WORKER AUTOSCALING"

    # Fase 4: Carga pico controlada (8 minutos) - Mantener cola llena con múltiples workers
    # 8 usuarios/s = ~4 uploads/s = ~240 uploads/min
    - duration: 480
      arrivalRate: 8
      name: "Peak Video Load - Test Multiple Workers"

    # Fase 5: Reducción gradual (5 minutos) - Permitir que workers drenen la cola
    - duration: 300
      arrivalRate: 8
      rampTo: 2
      name: "Ramp Down - Allow Queue Drain"

    # Fase 6: Recuperación extendida (15 minutos) - Permitir scale-in de workers
    - duration: 900
      arrivalRate: 0
      name: "Recovery - Monitor Worker Scale In (Extended)"

  payload:
    path: './scripts/load-test-data.csv'
    fields:
      - 'email'
      - 'first_name'
      - 'last_name'
      - 'city'

  variables:
    test_password: "StrongPass123"

  processor: "scripts/processor.js"

scenarios:
  # Escenario optimizado para llenar la cola SQS con trabajos de procesamiento de video

  # 35% - Upload de videos (ajustado para mantener cola SQS llena sostenidamente)
  - name: "Video Upload Heavy"
    weight: 35
    flow:
      - function: "generateUniqueEmail"

      # Registro
      - post:
          url: "/api/auth/signup"
          json:
            first_name: "VideoUser{{ $randomNumber(10000, 99999) }}"
            last_name: "Upload"
            email: "{{ uniqueEmail }}"
            password1: "{{ test_password }}"
            password2: "{{ test_password }}"
            city: "{{ city }}"
            country: "Colombia"
          expect:
            - statusCode: 201

      # Pausa después de registro
      - think: 2

      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ uniqueEmail }}"
            password: "{{ test_password }}"
          expect:
            - statusCode: 200
          capture:
            - json: "$.access_token"
              as: "upload_token"

      # Verificar autenticación antes de upload
      - get:
          url: "/api/videos"
          headers:
            Authorization: "Bearer {{ upload_token }}"
          expect:
            - statusCode: 200

      # Pausa importante antes del upload (evitar burst)
      - think: 3

      # Upload del video - Esto genera un mensaje en SQS
      - function: "uploadVideo"

      # Pausa después del upload
      - think: 2

  # 40% - Verificar estado de videos (balanceado para dar respiro)
  - name: "Check Video Status"
    weight: 40
    flow:
      - function: "generateUniqueEmail"

      - post:
          url: "/api/auth/signup"
          json:
            first_name: "Checker{{ $randomNumber(10000, 99999) }}"
            last_name: "Status"
            email: "{{ uniqueEmail }}"
            password1: "{{ test_password }}"
            password2: "{{ test_password }}"
            city: "{{ city }}"
            country: "Colombia"
          expect:
            - statusCode: 201

      - think: 2

      - post:
          url: "/api/auth/login"
          json:
            email: "{{ uniqueEmail }}"
            password: "{{ test_password }}"
          expect:
            - statusCode: 200
          capture:
            - json: "$.access_token"
              as: "check_token"

      # Consultar videos repetidamente (simular usuario esperando procesamiento)
      - loop:
          - get:
              url: "/api/videos"
              headers:
                Authorization: "Bearer {{ check_token }}"
              expect:
                - statusCode: 200
          - think: 5
        count: 3

  # 25% - Navegación básica (manteniendo respiro al sistema)
  - name: "Browse Videos"
    weight: 25
    flow:
      - get:
          url: "/api/public/videos"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/public/rankings"
          expect:
            - statusCode: 200
      - think: 3
      - get:
          url: "/health"
          expect:
            - statusCode: 200